title: Executable Run from Recycle Bin
id: 814d2c52-b9ef-4bd6-854b-4d70fdf36a1e
description: Detects execution of a binary from the Recycle Bin—a common LOL technique for hiding payloads from casual users.
status: experimental
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|contains: 'Recycle'
    Image|endswith: '.exe'
  condition: selection
falsepositives:
  - Rare legitimate debugging/testing artifacts
level: high
tags:
  - attack.defense_evasion
  - attack.execution
