title: Suspicious Scheduled Task Created with Admin Privileges
id: f2c0f6b3-f5d5-45b3-a740-b6bba8f2d1a2
status: experimental
description: Detects creation of a scheduled task that explicitly sets run level to highest (admin)
author: blizzardinfosec
date: 2025-06-21
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith: \schtasks.exe
    CommandLine|contains:
      - "/ru SYSTEM"
      - "/RL HIGHEST"
  condition: selection
level: high
tags:
  - attack.persistence
  - attack.privilege_escalation
  - attack.t1053.005
