title: Suspicious WScript Execution with JS Obfuscation
id: 24b83b79-3e9e-4c96-93e2-7091c6bc04ab
description: Detects WScript running JavaScript containing string obfuscation patterns like `fromCharCode`, `reverse`, or hex-encoded payloads.
status: experimental
logsource:
  product: windows
  service: sysmon
  category: process_creation
detection:
  selection:
    Image|endswith: 'wscript.exe'
    CommandLine|contains:
      - 'fromCharCode'
      - 'reverse'
      - '\\x'
  condition: selection
falsepositives:
  - Complex installers or scripts in enterprise software
level: high
tags:
  - attack.execution
  - attack.obfuscation
