title: Okta MFA Bypass Attempt
id: 3fa85f64-5717-4562-b3fc-2c963f66afa6
description: Detects the use of a legacy protocol that bypasses MFA protections in Okta
status: stable
logsource:
  product: okta
  service: authentication
detection:
  selection:
    eventType: user.session.start
    authenticationContext.authenticationMethod: legacy
  condition: selection
falsepositives:
  - Legacy systems that have not been upgraded
level: high
tags:
  - attack.initial_access
  - attack.t1078
