title: Shell Spawned in BusyBox or Alpine Container
id: b6a281e7-8819-4137-b8b0-f09e6765102a
status: stable
description: Detects `sh` being launched in containers based on minimal images like BusyBox or Alpine, often used for evasion or staging.
author: blizzardinfosec
logsource:
  product: linux
  category: process_creation
detection:
  selection:
    Image|contains: ['busybox', 'alpine']
    CommandLine|contains: ['sh']
  condition: selection
level: high
tags:
  - attack.execution
  - attack.defense_evasion
falsepositives:
  - Debugging legitimate containers
