title: Sudo Execution Spawned from Non-Terminal macOS App
id: c9a1bcd1-552f-4666-a750-94a98c469823
status: experimental
description: Detects sudo run from a non-terminal app (e.g. browser or GUI app) — often indicative of malware abusing user context
author: blizzardinfosec
date: 2025-06-21
logsource:
  product: macos
  category: process_creation
detection:
  selection:
    Image|endswith: /sudo
  filter:
    ParentImage|endswith:
      - /Safari
      - /Google Chrome
      - /zoom.us
  condition: selection and filter
level: high
tags:
  - attack.privilege_escalation
  - attack.t1548.003
