title: Verkada - Badge Access Outside Business Hours
id: f9e4f69a-d2ef-49f7-8b79-cc37c329a404
description: Detects successful badge access events that occur outside of regular work hours.
status: experimental
logsource:
  product: verkada
  category: access_control
detection:
  selection:
    event.type: badge.access.granted
    event.timestamp|outside_business_hours: true
  condition: selection
level: medium
tags:
  - anomaly
  - physical_intrusion
falsepositives:
  - On-call personnel
  - Overnight staff
