title: Suspicious Mount of Host or /proc in Container
id: 223ae291-6769-4bb9-aec4-7c552c58e64a
description: Detects container processes attempting to mount sensitive host paths or `/proc` which may indicate escape attempts.
status: experimental
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    CommandLine|contains:
      - '--mount'
      - '/proc'
      - '/etc'
      - '/var/run/docker.sock'
  condition: selection
falsepositives:
  - Backup tools
  - Hostpath-based legitimate mounting
level: high
tags:
  - attack.privilege_escalation
  - attack.t1611
  - platform.container
