title: GitHub - Secret Detected in Commit
id: 8d4c02f4-bef4-43dc-8e2d-813a1ec6c2c6
description: Detects GitHub secret scanning alerts triggered by pushes that include secrets like AWS keys, tokens, or passwords.
status: stable
logsource:
  category: saas
  product: github
detection:
  selection:
    action: secret_scanning.alert_created
  condition: selection
level: high
tags:
  - github
  - attack.credential_exposure
  - data_leakage
falsepositives:
  - Red team simulation
