title: Suspicious Shell Launch from systemd Unit
id: a6938f29-009e-4ad3-bb9b-60d3960bb703
description: Detects a systemd service that starts an interactive shell or script interpreter—an uncommon and suspicious configuration.
status: experimental
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    ParentImage|endswith:
      - '/systemd'
    Image|endswith:
      - '/bash'
      - '/sh'
      - '/python'
  condition: selection
falsepositives:
  - Misconfigured services or dev tools
level: high
tags:
  - attack.persistence
  - attack.execution
  - platform.linux
