title: Linux Use of chattr to Lock Files
id: 96334a5d-1fcd-46e8-b5c6-7c1e5d0b019a
description: Detects use of the `chattr +i` command to make a file immutable, which is commonly abused by attackers and rootkits to protect backdoors or persistence files.
status: test
logsource:
  product: linux
  service: auditd
  category: process_creation
detection:
  selection:
    Image|endswith: '/chattr'
    CommandLine|contains:
      - '+i'
  condition: selection
falsepositives:
  - Legitimate hardening or integrity tools
level: high
tags:
  - attack.defense_evasion
  - attack.t1222.002
  - platform.linux
